{
  "texto": "[TIPO: TESIS AISLADA] [MATERIA: CONSTITUCIONAL,] [INSTANCIA: Primera Sala] [TESIS: 1a. XII/2015 (10a.)] [REGISTRO: 2008257]\n---------------------------------------------------------------------------------------------------------------------------\nCONDONACIÓN DE DEUDAS TRIBUTARIAS. LA PROPORCIONALIDAD Y RAZONABILIDAD JURÍDICA DE LA ELECCIÓN DEL LEGISLADOR FEDERAL DE EXCLUIR DE AQUÉLLA A LOS CRÉDITOS FISCALES PAGADOS, DEBEN SOMETERSE AL MÁS FLEXIBLE DE LOS ESCRUTINIOS.\n\nLas justificaciones, los motivos o las razones que el legislador debe o no proporcionar al establecer un trato diferenciado en materia de condonaciones, deben partir de la base de que éstas no son exigibles desde el punto de vista del principio de la generalidad tributaria. Ello, en razón de que es radicalmente distinto acercarse al tema de la proporcionalidad y razonabilidad jurídica de la exclusión del beneficio de la condonación, frente a la privación de un derecho constitucionalmente tutelado -restando a la esfera jurídica del quejoso-, en tanto que el primer supuesto no es exigible desde el punto de vista del principio de la generalidad tributaria. Ahora bien, si conforme a dicho principio lo ordinario no es la condonación, sino el pago de contribuciones, es inconcuso que la carga argumentativa al legislar no debe, en estos casos, pesar sobre las razones por las que se limita ese beneficio, es decir, por las que no se otorga la condonación a quienes ya pagaron el crédito fiscal, pues tales extremos no son sólo \"ordinarios\" o \"esperados\", sino que son demandados por la propia Constitución, al derivar del principio de generalidad en la tributación cuyo contenido ha sido desarrollado por esta Primera Sala en su jurisprudencia. De ahí que la proporcionalidad y razonabilidad jurídica de la elección del legislador federal de excluir de la condonación a los créditos fiscales pagados, deben someterse al más flexible de los escrutinios.",
  "origen": "2008257_1a. XII2015 (10a.).txt",
  "ref": "1a. XII/2015 (10a.) | Registro 2008257",
  "tipo": "TESIS AISLADA",
  "materia": [
    "constitucional",
    "fiscal"
  ],
  "instancia": "Primera Sala",
  "tesis": "1a. XII/2015 (10a.)",
  "registro": "2008257",
  "rubro": "CONDONACIÓN DE DEUDAS TRIBUTARIAS. LA PROPORCIONALIDAD Y RAZONABILIDAD JURÍDICA DE LA ELECCIÓN DEL LEGISLADOR FEDERAL DE EXCLUIR DE AQUÉLLA A LOS CRÉDITOS FISCALES PAGADOS, DEBEN SOMETERSE AL MÁS FLEXIBLE DE LOS ESCRUTINIOS.",
  "jurisdiccion": "FEDERAL",
  "entidad": "NA",
  "silo": "jurisprudencia_nacional",
  "temas": [
    "condonación de deudas tributarias",
    "proporcionalidad y razonabilidad jurídica",
    "principio de generalidad tributaria",
    "trato diferenciado legislativo",
    "escrutinio judicial de leyes"
  ],
  "nivel_jerarquico": "federal",
  "vias_procesales_aplicables": [
    "amparo_indirecto",
    "contencioso_administrativo"
  ],
  "requiere_analisis_constitucional": true,
  "requiere_jurisprudencia": true,
  "articulos_relacionados": [],
  "metadata_enriched_at": "2026-02-10T02:55:25.952349",
  "metadata_version": "v1.0_phase1"
}